Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/edc/ATSAMV71J20B.PIC
      <edc:SFRDef edc:_addr="0x4003C068" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="AFEC0_CDR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Converted Data" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C06C" edc:access="----------------------nnnnnnnnnn" edc:cname="AFEC0_COCR" edc:impl="0x3FF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="AOFF" edc:desc="Analog Offset" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C070" edc:access="--------------------------nn---n" edc:cname="AFEC0_TEMPMR" edc:impl="0x31" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="RTCT" edc:desc="Temperature Sensor RTC Trigger Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCMPMOD" edc:desc="Temperature Comparison Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Generates an event when the converted data is lower than the low threshold of the window." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Generates an event when the converted data is higher than the high threshold of the window." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="Generates an event when the converted data is in the comparison window." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="Generates an event when the converted data is out of the comparison window." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C074" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFEC0_TEMPCWR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="TLOWTHRES" edc:desc="Temperature Low Threshold" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="THIGHTHRES" edc:desc="Temperature High Threshold" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C078" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x4003C094" edc:access="----------------------nn----nn--" edc:cname="AFEC0_ACR" edc:impl="0x30C" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PGA0EN" edc:desc="PGA0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGA1EN" edc:desc="PGA1 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="IBCTL" edc:desc="AFE Bias Current Control" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C098" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4003C0A0" edc:access="--------------------nnnnnnnnnnnn" edc:cname="AFEC0_SHMR" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="DUAL0" edc:desc="Dual Sample &amp; Hold for channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL1" edc:desc="Dual Sample &amp; Hold for channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL2" edc:desc="Dual Sample &amp; Hold for channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL3" edc:desc="Dual Sample &amp; Hold for channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL4" edc:desc="Dual Sample &amp; Hold for channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL5" edc:desc="Dual Sample &amp; Hold for channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL6" edc:desc="Dual Sample &amp; Hold for channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL7" edc:desc="Dual Sample &amp; Hold for channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL8" edc:desc="Dual Sample &amp; Hold for channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL9" edc:desc="Dual Sample &amp; Hold for channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL10" edc:desc="Dual Sample &amp; Hold for channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL11" edc:desc="Dual Sample &amp; Hold for channel 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C0A4" edc:offset="0x2C"/>
      <edc:SFRDef edc:_addr="0x4003C0D0" edc:access="-------------------------------n" edc:cname="AFEC0_COSR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="CSEL" edc:desc="Sample &amp; Hold unit Correction Select" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C0D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFEC0_CVR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="Offset Correction" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="Gain Correction" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C0D8" edc:access="--------------------nnnnnnnnnnnn" edc:cname="AFEC0_CECR" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="ECORR0" edc:desc="Error Correction Enable for channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR1" edc:desc="Error Correction Enable for channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR2" edc:desc="Error Correction Enable for channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR3" edc:desc="Error Correction Enable for channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR4" edc:desc="Error Correction Enable for channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR5" edc:desc="Error Correction Enable for channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR6" edc:desc="Error Correction Enable for channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR7" edc:desc="Error Correction Enable for channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR8" edc:desc="Error Correction Enable for channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR9" edc:desc="Error Correction Enable for channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR10" edc:desc="Error Correction Enable for channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR11" edc:desc="Error Correction Enable for channel 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C0DC" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4003C0E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="AFEC0_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protect KEY" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x414443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C0E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="AFEC0_WPSR" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protect Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protect Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C0EC" edc:offset="0x3F14"/>
      <edc:SFRDef edc:_addr="0x40040000" edc:access="-------------------------------w" edc:cname="DACC_CR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040004" edc:access="----nnnnn-----------------nn--nn" edc:cname="DACC_MR" edc:impl="0xF800033" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="MAXS0" edc:desc="Max Speed Mode for Channel 0" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="TRIG_EVENT" edc:desc="External trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MAXIMUM" edc:desc="Max speed mode enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MAXS1" edc:desc="Max Speed Mode for Channel 1" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="TRIG_EVENT" edc:desc="External trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MAXIMUM" edc:desc="Max speed mode enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WORD" edc:desc="Word Transfer Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="One data to convert is written to the FIFO per access to DACC." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Two data to convert are written to the FIFO per access to DACC (reduces the number of requests to DMA and the number of system bus accesses)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ZERO" edc:desc="Must always be written to 0." edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x11"/>
            <edc:SFRFieldDef edc:cname="DIFF" edc:desc="Differential Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="DAC0 and DAC1 are single-ended outputs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="DACP and DACN are differential outputs. The differential level is configured by the channel 0 value." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:desc="Peripheral Clock to DAC Clock Ratio" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040008" edc:access="---------nnn-nnn-----nnn-nnn--nn" edc:cname="DACC_TRIGR" edc:impl="0x770773" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="TRGEN0" edc:desc="Trigger Enable of Channel 0" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="External trigger mode disabled. DACC is in Free-running mode or Max speed mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="External trigger mode enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGEN1" edc:desc="Trigger Enable of Channel 1" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="External trigger mode disabled. DACC is in Free-running mode or Max speed mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="External trigger mode enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGSEL0" edc:desc="Trigger Selection of Channel 0" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="TRGSEL0" edc:desc="DAC External Trigger Input (DATRG)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL1" edc:desc="TC0 Channel 0 Output (TIOA0)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL2" edc:desc="TC0 Channel 1 Output (TIOA1)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL3" edc:desc="TC0 Channel 2 Output (TIOA2)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL4" edc:desc="PWM0 Event Line 0" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL5" edc:desc="PWM0 Event Line 1" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL6" edc:desc="PWM1 Event Line 0" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL7" edc:desc="PWM1 Event Line 1" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGSEL1" edc:desc="Trigger Selection of Channel 1" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="TRGSEL0" edc:desc="DAC External Trigger Input (DATRG)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL1" edc:desc="TC0 Channel 0 Output (TIOA0)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL2" edc:desc="TC0 Channel 1 Output (TIOA1)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL3" edc:desc="TC0 Channel 2 Output (TIOA2)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL4" edc:desc="PWM0 Event Line 0" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL5" edc:desc="PWM0 Event Line 1" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL6" edc:desc="PWM1 Event Line 0" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL7" edc:desc="PWM1 Event Line 1" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="OSR0" edc:desc="Over Sampling Ratio of Channel 0" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OSR_1" edc:desc="OSR = 1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="OSR_2" edc:desc="OSR = 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OSR_4" edc:desc="OSR = 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OSR_8" edc:desc="OSR = 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="OSR_16" edc:desc="OSR = 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="OSR_32" edc:desc="OSR = 32" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OSR1" edc:desc="Over Sampling Ratio of Channel 1" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OSR_1" edc:desc="OSR = 1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="OSR_2" edc:desc="OSR = 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OSR_4" edc:desc="OSR = 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OSR_8" edc:desc="OSR = 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="OSR_16" edc:desc="OSR = 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="OSR_32" edc:desc="OSR = 32" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4004000C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40040010" edc:access="------------------------------ww" edc:cname="DACC_CHER" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040014" edc:access="------------------------------ww" edc:cname="DACC_CHDR" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040018" edc:access="----------------------rr------rr" edc:cname="DACC_CHSR" edc:impl="0x303" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DACRDY0" edc:desc="DAC Ready Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DACRDY1" edc:desc="DAC Ready Flag" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004001C" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="DACC_CDR0" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="DATA0" edc:desc="Data to Convert for channel 0" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DATA1" edc:desc="Data to Convert for channel 1" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040020" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="DACC_CDR1" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="DATA0" edc:desc="Data to Convert for channel 0" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DATA1" edc:desc="Data to Convert for channel 1" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040024" edc:access="--------------------------ww--ww" edc:cname="DACC_IER" edc:impl="0x33" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:desc="Transmit Ready Interrupt Enable of channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:desc="Transmit Ready Interrupt Enable of channel 1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Enable of channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Enable of channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40040028" edc:access="--------------------------ww--ww" edc:cname="DACC_IDR" edc:impl="0x33" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:desc="Transmit Ready Interrupt Disable of channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:desc="Transmit Ready Interrupt Disable of channel 1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Disable of channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Disable of channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004002C" edc:access="--------------------------rr--rr" edc:cname="DACC_IMR" edc:impl="0x33" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:desc="Transmit Ready Interrupt Mask of channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:desc="Transmit Ready Interrupt Mask of channel 1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Mask of channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Mask of channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
