Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/edc/ATSAMV71J20B.PIC
      <edc:AdjustPoint edc:_addr="0x40054034" edc:offset="0x8C"/>
      <edc:SFRDef edc:_addr="0x400540C0" edc:access="-------------------------------w" edc:cname="TC3_BCR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Synchro Command" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400540C4" edc:access="--nnnnnnnnnn-nnnnnnnnnnn--nnnnnn" edc:cname="TC3_BMR" edc:impl="0x3FF7FF3F" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="TC0XC0S" edc:desc="External Clock Signal 0 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK0" edc:desc="Signal connected to XC0: TCLK0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC0: TIOA1" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC0: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC1XC1S" edc:desc="External Clock Signal 1 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK1" edc:desc="Signal connected to XC1: TCLK1" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC1: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC1: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC2XC2S" edc:desc="External Clock Signal 2 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK2" edc:desc="Signal connected to XC2: TCLK2" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC2: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC2: TIOA1" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="QDEN" edc:desc="Quadrature Decoder Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSEN" edc:desc="Position Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPEEDEN" edc:desc="Speed Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QDTRANS" edc:desc="Quadrature Decoding Transparent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EDGPHA" edc:desc="Edge on PHA Count Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVA" edc:desc="Inverted PHA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVB" edc:desc="Inverted PHB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVIDX" edc:desc="Inverted Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAP" edc:desc="Swap PHA and PHB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDXPHB" edc:desc="Index Pin is PHB Pin" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AUTOC" edc:desc="AutoCorrection of missing pulses" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MAXFILT" edc:desc="Maximum Filter" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="MAXCMP" edc:desc="Maximum Consecutive Missing Pulses" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400540C8" edc:access="----------------------------wwww" edc:cname="TC3_QIER" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:desc="Consecutive Missing Pulse Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400540CC" edc:access="----------------------------wwww" edc:cname="TC3_QIDR" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:desc="Consecutive Missing Pulse Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400540D0" edc:access="----------------------------rrrr" edc:cname="TC3_QIMR" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIRCHG" edc:desc="Direction Change" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QERR" edc:desc="Quadrature Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:desc="Consecutive Missing Pulse Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
